JRB-90/jpower/src/nrf52/lib/strain/strain.c
#include "strain.h"

#include "ad779x.h"
#include "calibrate_ble_srv.h"
#include "nrf_log.h"

#define KG_TO_N 9.81

static nrf_drv_spi_t* spi = NULL;
static calibration_data_t current_cal = { 0 };
static uint32_t current_adc_value = 0;
static float current_force_n = 0.0f;
static float current_torque_nm = 0.0f;

static void on_zero_requested();
static uint32_t on_measure_requested(uint8_t num_samples);

ret_code_t strain_init(
    nrf_drv_spi_t* spi_instance,
    const uint8_t sck_pin,
    const uint8_t mosi_pin,
    const uint8_t miso_pin,
    const uint8_t ss_pin)
{
    ret_code_t err_code;

    spi = spi_instance;

    // Dummy data for now
    current_cal = (calibration_data_t)
    {
        .cal_id = {{ 0 }},
        .offset = 8548141,
        .crank_length_m = 0.1725f,
        .slope = 209018.859f,
        .intercept = 8386309.5f,
    };

    err_code =
        ad779x_init(
            spi,
            sck_pin,
            mosi_pin,
            miso_pin,
            ss_pin
        );
    APP_ERROR_CHECK(err_code);

    ad7799_write_offset_reg(current_cal.offset);

    calibrate_reg_pull_cal_cb(strain_get_calibration);
    calibrate_reg_cal_pushed_cb(strain_set_calibration);
    calibrate_reg_zero_offset_cb(on_zero_requested);
    calibrate_reg_measure_cb(on_measure_requested);

    return NRF_SUCCESS;
}

void strain_update_10ms(float delta_time_s)
{
    current_adc_value = ad7799_read_raw_data_single();

    // F = (adc - intercept) / slope
    current_force_n = ((current_adc_value - current_cal.intercept) / current_cal.slope) * KG_TO_N;
    // T = F * r
    current_torque_nm = current_force_n * current_cal.crank_length_m;
}

void strain_get_calibration(calibration_data_t* const calibration)
{
    *calibration = current_cal;
}

void strain_set_calibration(calibration_data_t* const calibration)
{
    current_cal = *calibration;
}

uint32_t strain_get_current_adv_value()
{
    return current_adc_value;
}

float strain_get_current_force_n()
{
    return current_force_n;
}

float strain_get_current_torque_nm()
{
    return current_torque_nm;
}

ret_code_t strain_zero_offset()
{
    uint32_t offset = ad7799_system_zeroscale_calibration();
    current_cal.offset = offset;

    return NRF_SUCCESS;
}

static void on_zero_requested()
{
    ret_code_t err_code = strain_zero_offset();
    APP_ERROR_CHECK(err_code);
}

static uint32_t on_measure_requested(uint8_t num_samples)
{
    // TODO - store last n samples and return average

    return current_adc_value;
}
